#ifndef ERRLIB_H
#define ERRLIB_H

////////// errlib ////////////////////////////////////////////////////////////
// Автор    : Баталов Семен                                                 //
// Дата     : 08.11.2020                                                    //
// Описание : Здесь представлены инструменты для обработки исключительных   //
//            ситуаций в модулях для решения филиппинского кроссворда.      //
//////////////////////////////////////////////////////////////////////////////

#include <cstdint>
#include <exception>

namespace err
{
    ////////// class Exception ///////////////////////////////////////////////
    // Дочерний класс, унаследованный от "std::exception". Содежит в себе   //
    // код ошибки "errCode_".                                               //
    //////////////////////////////////////////////////////////////////////////
    
    class Exception : public std::exception
    {
        private :
            
            int16_t errCode_;       // Код ошибки (0 - отсутствие ошибок)
            
        public :
            
            // (1) Конструктор (обнуляет поле)
            Exception();
            
            // (2) Конструктор (инициализирует поле)
            Exception(const int16_t& newErrCode);
	    
            // (3) Конструктор копирования
            Exception(const Exception& exeption);
	    
            // (4) Перегрузка оператора присваивания
            Exception& operator=(const Exception& exeption);
            
            // (5) Возвращает код ошибки
            int16_t error() const;
    };
}


#endif