////////// errlib ////////////////////////////////////////////////////////////
// Автор    : Баталов Семен                                                 //
// Дата     : 08.11.2020                                                    //
// Описание : Здесь представлены инструменты для обработки исключительных   //
//            ситуаций в модулях для решения филиппинского кроссворда.      //
//////////////////////////////////////////////////////////////////////////////

#include "errlib.h"

using namespace err;

////////// class Exception ///////////////////////////////////////////////////
// Описание : errlib.h                                                      //
//////////////////////////////////////////////////////////////////////////////

// (1) Конструктор (обнуляет поле)
Exception::Exception()
{
    errCode_ = 0;
}

// (2) Конструктор (инициализирует поле)
Exception::Exception(int16_t newErrCode)
{
    errCode_ = newErrCode;
}

// (5) Возвращает код ошибки
int16_t Exception::error() const
{
    return errCode_;
}

////////// class PcsException ////////////////////////////////////////////////
// Описание : errlib.h                                                      //
//////////////////////////////////////////////////////////////////////////////

// (5) Виртуальный метод возврата сообщения об ошибке
const char* PcsException::what() const noexcept
{
    return "err::PcsException";
}

////////// class RwcException ////////////////////////////////////////////////
// Описание : errlib.h                                                      //
//////////////////////////////////////////////////////////////////////////////

// (5) Виртуальный метод возврата сообщения об ошибке
const char* RwcException::what() const noexcept
{
    return "err::RwcException";
}